# Import Libraries

In [1]:
# Import Libraries

import pandas as pd
import numpy as np
import os

# Import Data

In [2]:
# Set a path

path = r'C:\Users\Tina\Desktop\CareerFoundry\Data Analytics Immersion\Instacart Basket Analysis'

In [3]:
# Import "orders_products_combined"

ords_prods_comb = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [4]:
# Import "products"

prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

# First look at data

In [5]:
# Check shape of "orders_products_combined"

ords_prods_comb.shape

(32434489, 12)

In [6]:
ords_prods_comb.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,0,2539329,1,1,2,8,NaN,196,1,0,both
1,0,0,2539329,1,1,2,8,NaN,14084,2,0,both
2,0,0,2539329,1,1,2,8,NaN,12427,3,0,both
3,0,0,2539329,1,1,2,8,NaN,26088,4,0,both
4,0,0,2539329,1,1,2,8,NaN,26405,5,0,both

In [7]:
ords_prods_comb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434489 entries, 0 to 32434488
Data columns (total 12 columns):
 #   Column                  Dtype
---  ------                  -----
 0   Unnamed: 0.1            int64
 1   Unnamed: 0              int64
 2   order_id                int64
 3   user_id                 int64
 4   order_number            int64
 5   orders_day_of_week      int64
 6   order_hour_of_day       int64
 7   days_since_prior_order  float64
 8   product_id              int64
 9   add_to_cart_order       int64
 10  reordered               int64
 11  _merge                  category
dtypes: category(1), float64(1), int64(10)
memory usage: 2.7 GB

In [8]:
# Check shape of "products"

prods.shape

(49672, 6)

In [9]:
prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [10]:
prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49672 entries, 0 to 49671
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     49672 non-null  int64
 1   product_id     49672 non-null  int64
 2   product_name   49672 non-null  object
 3   aisle_id       49672 non-null  int64
 4   department_id  49672 non-null  int64
 5   prices         49672 non-null  float64
dtypes: float64(1), int64(4), object(1)
memory usage: 2.3+ MB

# Change datatypes

In [11]:
# Change types for "ords_prods_comb"

ords_prods_comb['order_id'] = ords_prods_comb['order_id'].astype('int32')
ords_prods_comb['user_id'] = ords_prods_comb['user_id'].astype('int32')
ords_prods_comb['order_number'] = ords_prods_comb['order_number'].astype('int8')
ords_prods_comb['orders_day_of_week'] = ords_prods_comb['orders_day_of_week'].astype('int8')
ords_prods_comb['order_hour_of_day'] = ords_prods_comb['order_hour_of_day'].astype('int8')
ords_prods_comb['days_since_prior_order'] = ords_prods_comb['days_since_prior_order'].astype('float16')
ords_prods_comb['product_id'] = ords_prods_comb['product_id'].astype('int32')
ords_prods_comb['reordered'] = ords_prods_comb['reordered'].astype('int8')
ords_prods_comb['add_to_cart_order'] = ords_prods_comb['add_to_cart_order'].astype('int32')

In [12]:
# Check output to see memory usage

ords_prods_comb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434489 entries, 0 to 32434488
Data columns (total 12 columns):
 #   Column                  Dtype
---  ------                  -----
 0   Unnamed: 0.1            int64
 1   Unnamed: 0              int64
 2   order_id                int32
 3   user_id                 int32
 4   order_number            int8
 5   orders_day_of_week      int8
 6   order_hour_of_day       int8
 7   days_since_prior_order  float16
 8   product_id              int32
 9   add_to_cart_order       int32
 10  reordered               int8
 11  _merge                  category
dtypes: category(1), float16(1), int32(4), int64(2), int8(4)
memory usage: 1.2 GB

In [13]:
# Change datatypes for "prods"

prods['aisle_id'] = prods['aisle_id'].astype('int8')
prods['department_id'] = prods['department_id'].astype('int8')

In [14]:
# Check outcome to see memory usage

prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49672 entries, 0 to 49671
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     49672 non-null  int64
 1   product_id     49672 non-null  int64
 2   product_name   49672 non-null  object
 3   aisle_id       49672 non-null  int8
 4   department_id  49672 non-null  int8
 5   prices         49672 non-null  float64
dtypes: float64(1), int64(2), int8(2), object(1)
memory usage: 1.6+ MB

# Merge dataframes

In [15]:
# Drop unneccessary columns from "ords_prods_comb"

ords_prods_comb.drop(columns = {'Unnamed: 0.1', 'Unnamed: 0', '_merge'}, inplace = True)

In [16]:
ords_prods_comb.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [17]:
# Drop unneccessary columns from "prods"

prods.drop(columns = 'Unnamed: 0', inplace = True)

In [18]:
prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [19]:
# Merge the two dataframes

merged = ords_prods_comb.merge(prods, on = 'product_id', indicator = True)

In [20]:
merged.shape

(32404859, 14)

In [21]:
merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [22]:
merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 14 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 int32
 2   order_number            int8
 3   orders_day_of_week      int8
 4   order_hour_of_day       int8
 5   days_since_prior_order  float16
 6   product_id              int32
 7   add_to_cart_order       int32
 8   reordered               int8
 9   product_name            object
 10  aisle_id                int8
 11  department_id           int8
 12  prices                  float64
 13  _merge                  category
dtypes: category(1), float16(1), float64(1), int32(4), int8(6), object(1)
memory usage: 1.2+ GB

In [23]:
# Confirm the merge

merged['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

# Export Dataframe

In [24]:
# Export Dataframe

merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge.pkl'))